{
  "id": "javascript",
  "slug": "javascript",
  "title": "JavaScript",
  "subtitle": "The programming language of the web",
  "content": "## Overview\n\n**JavaScript**, often abbreviated as **JS**, is a programming language and core technology of the World Wide Web, alongside HTML and CSS. As of 2024, 99% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries.\n\nJavaScript is a high-level, often just-in-time compiled language that conforms to the ECMAScript standard. It has dynamic typing, prototype-based object-orientation, and first-class functions. It is multi-paradigm, supporting event-driven, functional, and imperative programming styles.\n\n## History\n\nJavaScript was created in 1995 by Brendan Eich while he was an engineer at Netscape. It was originally developed under the name Mocha, then renamed to LiveScript, and finally to JavaScript.\n\nThe language was standardized in 1997 as ECMAScript. Major updates include ES6 (ECMAScript 2015), which introduced classes, modules, arrow functions, template literals, and many other features.\n\n## Key Features\n\n### Dynamic Typing\n\nJavaScript is a dynamically typed language, meaning variable types are determined at runtime rather than at compile time. This provides flexibility but can lead to runtime errors. [[TypeScript]] was created to address this by adding static type checking.\n\n### First-Class Functions\n\nIn JavaScript, functions are first-class objects. They can be assigned to variables, passed as arguments, and returned from other functions. This enables powerful functional programming patterns.\n\n### Prototype-Based Inheritance\n\nUnlike classical object-oriented languages, JavaScript uses prototype-based inheritance. Objects can inherit directly from other objects through the prototype chain.\n\n### Asynchronous Programming\n\nJavaScript supports asynchronous programming through callbacks, Promises, and async/await syntax. This is essential for non-blocking operations like network requests and file I/O, particularly in [[Node.js]].\n\n## JavaScript Ecosystem\n\n- **[[React]]** — UI library for building component-based interfaces\n- **[[Node.js]]** — Server-side JavaScript runtime\n- **[[TypeScript]]** — Typed superset of JavaScript\n- **[[Express]]** — Web application framework for [[Node.js]]\n\n## Modern JavaScript (ES6+)\n\nModern JavaScript includes many features that make the language more powerful and expressive:\n\n- **Arrow Functions**: `const add = (a, b) => a + b`\n- **Destructuring**: `const { name, age } = person`\n- **Spread Operator**: `const arr = [...oldArr, newItem]`\n- **Modules**: `import/export` for code organization\n- **Async/Await**: Cleaner asynchronous code\n- **Template Literals**: String interpolation with backticks",
  "categories": ["JavaScript", "Programming Languages", "Web Development"],
  "relatedArticles": ["react", "nodejs", "typescript", "web-development"],
  "metadata": {
    "created": "2026-01-08T08:00:00Z",
    "lastModified": "2026-01-25T11:45:00Z"
  }
}
