{
  "id": "nodejs",
  "slug": "nodejs",
  "title": "Node.js",
  "subtitle": "A JavaScript runtime built on Chrome's V8 engine",
  "content": "## Overview\n\n**Node.js** is an open-source, cross-platform [[JavaScript]] runtime environment that executes JavaScript code outside a web browser. Node.js lets developers use JavaScript to write command-line tools and for server-side scripting — running scripts server-side to produce dynamic web page content before the page is sent to the user's web browser.\n\nNode.js represents a \"JavaScript everywhere\" paradigm, unifying [[Web Development]] around a single programming language, rather than using different languages for server-side and client-side scripts.\n\n## History\n\nNode.js was written initially by Ryan Dahl in 2009, about thirteen years after the introduction of the first server-side JavaScript environment. The initial release supported only Linux and Mac OS X. Its development and maintenance was led by Dahl and later sponsored by Joyent.\n\nDahl demonstrated the project at the inaugural European JSConf on November 8, 2009. Dahl criticized the limited possibilities of the most popular web server in 2009, Apache HTTP Server, to handle many concurrent connections.\n\n## Key Features\n\n### Event-Driven Architecture\n\nNode.js operates on a single-threaded event loop, using non-blocking I/O calls, allowing it to support tens of thousands of concurrent connections without incurring the cost of thread context switching.\n\n### npm\n\nnpm (Node Package Manager) is the default package manager for Node.js. It consists of a command-line client and an online database of public and paid-for private packages called the npm registry. The registry is accessed via the client, and the available packages can be browsed and searched via the npm website.\n\n### V8 Engine\n\nNode.js uses Google's V8 JavaScript engine to execute code. V8 compiles JavaScript directly to native machine code using just-in-time compilation before executing it.\n\n## Common Use Cases\n\n- **Web Servers**: Building [[REST API]] servers and web applications\n- **Real-time Applications**: Chat apps, live dashboards, gaming\n- **Command Line Tools**: Build tools, automation scripts\n- **Microservices**: Building distributed systems\n- **API Development**: Creating [[REST API]] endpoints with [[Express]]\n\n## Getting Started\n\n```\n# Check Node.js version\nnode --version\n\n# Initialize a new project\nnpm init -y\n\n# Create a simple server\nnode server.js\n```\n\n## Related Technologies\n\n- **[[Express]]** — The most popular web framework for Node.js\n- **[[React]]** — Frontend library often used with Node.js backends\n- **[[JavaScript]]** — The language that Node.js executes\n- **[[REST API]]** — Common architecture for Node.js APIs",
  "categories": ["JavaScript", "Backend", "Web Development"],
  "relatedArticles": ["javascript", "express", "react", "rest-api"],
  "metadata": {
    "created": "2026-01-12T09:15:00Z",
    "lastModified": "2026-01-28T09:15:00Z"
  }
}
