{
  "id": "react",
  "slug": "react",
  "title": "React",
  "subtitle": "A JavaScript library for building user interfaces",
  "content": "## Overview\n\n**React** (also known as React.js or ReactJS) is a free and open-source front-end [[JavaScript]] library for building user interfaces based on components. It is maintained by Meta (formerly Facebook) and a community of individual developers and companies.\n\nReact can be used to develop single-page, mobile, or server-rendered applications with frameworks like Next.js. Because React is only concerned with the user interface and rendering components to the DOM, React applications often rely on libraries for routing and other client-side functionality.\n\n## History\n\nReact was created by Jordan Walke, a software engineer at Meta. It was first deployed on Facebook's News Feed in 2011 and later on Instagram in 2012. It was open-sourced at JSConf US in May 2013.\n\nReact Native, which enables native Android, iOS, and UWP development with React, was announced at Facebook's React Conf in February 2015 and open-sourced in March 2015.\n\n## Key Features\n\n### Components\n\nReact code is made of entities called components. Components can be rendered to a particular element in the DOM using the React DOM library. When rendering a component, values can be passed between components through \"props\".\n\n### JSX\n\nJSX, or JavaScript XML, is an extension to the [[JavaScript]] language syntax. Similar in appearance to HTML, JSX provides a way to structure component rendering using syntax familiar to many developers.\n\n### Virtual DOM\n\nAnother notable feature is the use of a virtual Document Object Model, or Virtual DOM. React creates an in-memory data-structure cache, computes the resulting differences, and then updates the browser's displayed DOM efficiently.\n\n### Hooks\n\nHooks are functions that let developers \"hook into\" React state and lifecycle features from function components. Hooks were introduced in React 16.8 and allow developers to use state and other React features without writing a class.\n\n## Getting Started\n\nThe recommended way to create a new React application is using a framework like Next.js or using build tools like Vite:\n\n```\nnpm create vite@latest my-app -- --template react\ncd my-app\nnpm install\nnpm run dev\n```\n\n## Related Technologies\n\n- **[[Node.js]]** — Often used as the backend runtime for React applications\n- **[[TypeScript]]** — Adds static typing to React projects\n- **[[Express]]** — Backend framework commonly paired with React\n- **[[Web Development]]** — The broader field encompassing React development",
  "categories": ["JavaScript", "Frontend", "Web Development"],
  "relatedArticles": ["javascript", "nodejs", "typescript", "web-development"],
  "metadata": {
    "created": "2026-01-10T10:00:00Z",
    "lastModified": "2026-02-01T14:30:00Z"
  }
}
