{
  "id": "typescript",
  "slug": "typescript",
  "title": "TypeScript",
  "subtitle": "A typed superset of JavaScript",
  "content": "## Overview\n\n**TypeScript** is a free and open-source high-level programming language developed by Microsoft that adds static typing with optional type annotations to [[JavaScript]]. It is designed for the development of large applications and transpiles to JavaScript.\n\nTypeScript may be used to develop JavaScript applications for both client-side and server-side execution (as with [[Node.js]]). Multiple options are available for transpilation. The TypeScript compiler can be used, or the Babel compiler can be invoked to convert TypeScript to JavaScript.\n\n## History\n\nTypeScript was first made public in October 2012 (at version 0.8), after two years of internal development at Microsoft. Anders Hejlsberg, lead architect of C#, has worked on the development of TypeScript.\n\n## Key Features\n\n### Static Typing\n\nTypeScript adds optional static typing to JavaScript. Types can be added to variables, function parameters, and return values. The TypeScript compiler checks types at compile time, catching errors before runtime.\n\n```\nfunction greet(name: string): string {\n  return `Hello, ${name}!`;\n}\n```\n\n### Interfaces\n\nInterfaces define the structure of objects, providing a powerful way to define contracts within your code and contracts with code outside your project.\n\n```\ninterface User {\n  name: string;\n  age: number;\n  email?: string; // optional property\n}\n```\n\n### Generics\n\nGenerics allow you to create reusable components that work with a variety of types rather than a single one.\n\n### Enums\n\nTypeScript provides both numeric and string-based enums, making it easier to document intent or create a set of distinct cases.\n\n## TypeScript with React\n\nTypeScript is widely used with [[React]] to provide type safety for components, props, and state. The combination improves developer experience with better autocomplete, refactoring support, and error detection.\n\n## Getting Started\n\n```\n# Install TypeScript globally\nnpm install -g typescript\n\n# Initialize a TypeScript project\ntsc --init\n\n# Compile TypeScript to JavaScript\ntsc\n```\n\n## Related Technologies\n\n- **[[JavaScript]]** — The language TypeScript builds upon\n- **[[React]]** — Commonly used with TypeScript for type-safe UI\n- **[[Node.js]]** — TypeScript can be used for server-side development\n- **[[Web Development]]** — TypeScript is a key tool in modern web dev",
  "categories": ["JavaScript", "Programming Languages", "Frontend"],
  "relatedArticles": ["javascript", "react", "nodejs", "web-development"],
  "metadata": {
    "created": "2026-01-14T11:30:00Z",
    "lastModified": "2026-02-03T08:45:00Z"
  }
}
